dpalchak/estoppel/third_party/st/stm32l4_sdk/v1.12.0/Projects/32L476GDISCOVERY/Demonstrations/Modules/audioplayer/audioplayer.c
/**
  ******************************************************************************
  * @file    audioplayer.c
  * @author  MCD Application Team   
  * @brief   Audio player application functions
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
  
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "k_config.h"
#include "k_module.h"
#include "k_menu.h"
#include "audioplayer.h"
#include "stm32l476g_discovery_audio.h"

/** @addtogroup AUDIO_PLAYER_MODULE
  * @{
  */

/** @defgroup AUDIO_APPLICATION
  * @brief audio application routines
  * @{
  */

/* Private defines -----------------------------------------------------------*/
/* Size (in bytes) of the buffer containing the PCM samples */
#define AUDIO_BUFFER_SIZE          (1024 * 4)
   
/* Audio file address in FLASH memory*/ 
#define AUDIO_FILE_ADDRESS         (uint32_t)0x08020000  

/* Size (in bytes) of a WAV header */
#define WAV_HEADER_SIZE 44

/* Audio volume level range (min..max) */
#define AUDIO_VOLUME_MAX 100
#define AUDIO_VOLUME_MIN 50

/* Private typedef -----------------------------------------------------------*/
/* Audio player services errors */
typedef enum
{
  AUDIOPLAYER_ERROR_NONE = 0,
  AUDIOPLAYER_ERROR_IO,
  AUDIOPLAYER_ERROR_HW,
  AUDIOPLAYER_ERROR_MEM,
  AUDIOPLAYER_ERROR_FORMAT_NOTSUPPORTED,
  AUDIOPLAYER_ERROR_INITIALIZATION,
  AUDIOPLAYER_ERROR_FILE_NOT_FOUND,
  AUDIOPLAYER_ERROR_OS
}AudioPlayer_ErrorTypeDef;

/* Audio player status */
typedef enum
{
  AUDIOPLAYER_STOPPED = 0, 
  AUDIOPLAYER_STARTED,   
  AUDIOPLAYER_PAUSED, 
  AUDIOPLAYER_EOF,   
  AUDIOPLAYER_ERROR,  
}AudioPlayer_StateTypeDef;

/* Playback buffer offset */
typedef enum
{
  PLAYER_BUFFER_OFFSET_NONE = 0,  
  PLAYER_BUFFER_OFFSET_HALF,  
  PLAYER_BUFFER_OFFSET_FULL,     
} BUFFER_StateTypeDef;

/* WAV header structure */
typedef struct
{
  char       RIFF[4];          /* 0 */ 
  uint32_t   ChunkSize;        /* 4 */
  char       WAVE[4];          /* 8 */
  char       fmt[4];           /* 12 */
  uint32_t   SubChunk1Size;    /* 16*/  
  uint16_t   AudioFormat;      /* 20 */ 
  uint16_t   NbrChannels;      /* 22 */   
  uint32_t   SampleRate;       /* 24 */
  uint32_t   ByteRate;         /* 28 */
  uint16_t   BlockAlign;       /* 32 */  
  uint16_t   BitPerSample;     /* 34 */  
  char       SubChunk2ID[4];   /* 36 */   
  uint32_t   SubChunk2Size;    /* 40 */    
}WAV_HeaderTypeDef;

/* Audio source (FLASH v.s. Quad SPI flash) */
typedef enum {
  AUDIO_SOURCE_FLASH = 0,
  AUDIO_SOURCE_QSPI,
  /* Latest entry shall be AUDIO_SOURCE_NONE and AUDIO_SOURCES_NB */
  AUDIO_SOURCE_NONE,
  AUDIO_SOURCES_NB
} AudioSource_TypeDef;

/* Audio player context information */
typedef struct {
  uint16_t                  buffer[AUDIO_BUFFER_SIZE/2];  // Buffer containig the PCM samples to play  
  uint32_t                  volume;                       // Actual volume level
  AudioPlayer_StateTypeDef  state;                        // Actual audio player status
  uint32_t                  NbAudioSources;               // Number of audio sources
  AudioSource_TypeDef       AudioSource;                  // Actual audio source
  WAV_HeaderTypeDef         WavHeader[AUDIO_SOURCES_NB];  // Wav headers (onbe per audio source)
  uint32_t                  start;                        // Offset of the first audio sample
  uint32_t                  end;                          // Offset of the last audio sample
  uint32_t                  read;                         // Actual read offset
} AudioPlayer_ContextTypeDef;

