dpalchak/estoppel/third_party/st/stm32l4_sdk/v1.12.0/Projects/32L476GDISCOVERY/Demonstrations/Modules/audioplayer/audioplayer.c
/* Private function prototypes -----------------------------------------------*/
/* Audio player kModule related functions */
static KMODULE_RETURN AudioPlayerPreExec(void);
static KMODULE_RETURN AudioPlayer_Exec(void);
static KMODULE_RETURN AudioPlayerPostExec(void);
static void AudioPlayer_Run(void);

/* Audio player services */
static AudioPlayer_ErrorTypeDef  AudioPlayer_Init(void);
static AudioPlayer_ErrorTypeDef  AudioPlayer_DeInit(void);
static AudioPlayer_ErrorTypeDef  AudioPlayer_Start(uint32_t frequency);
static AudioPlayer_ErrorTypeDef  AudioPlayer_Stop(void);
static AudioPlayer_ErrorTypeDef  AudioPlayer_Pause(void);
static AudioPlayer_ErrorTypeDef  AudioPlayer_Resume(void);
static AudioPlayer_ErrorTypeDef  AudioPlayer_SetVolume(uint32_t volume);
static uint32_t                  AudioPlayer_GetVolume(void);

/* Audio player thread */
static void AudioPlayer_Thread(void const * argument);

/* Audio player callback functions */
static void AudioPlayer_TransferComplete_CallBack(void);
static void AudioPlayer_HalfTransfer_CallBack(void);
static void AudioPlayer_Error_CallBack(void);

/* Internal services */
static uint8_t IsValidWAVHeader(WAV_HeaderTypeDef* WAV_header);
static uint8_t ReadAudio( uint16_t* buff,
                          uint32_t btr,
                          uint32_t* br);
static uint8_t PlaylistInit(void);
static AudioSource_TypeDef AudioSourceSelect(void);


/* External variables --------------------------------------------------------*/
const K_ModuleItem_Typedef ModuleAudioPlayer =
{
  MODULE_AUDIOPLAYER,
  AudioPlayerPreExec,
  AudioPlayer_Exec,
  AudioPlayerPostExec,
  NULL
};  

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static AudioPlayer_ContextTypeDef hAudioPlayer;

static osMessageQId   AudioEvent;
static osThreadId     AudioThreadId = 0;

const tMenuItem AudioPlayerMenuItems[] =
{
    {"", 0, 0, SEL_EXEC, MODULE_NONE, AudioPlayer_Run, NULL, NULL, NULL},
};

const tMenu AudioPlayerMenu = {
  NULL, AudioPlayerMenuItems, countof(AudioPlayerMenuItems), TYPE_EXEC, 2, 3
  };

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Initialize AudioPlayer application 
  * @param  None.  
  * @retval None.
  */
KMODULE_RETURN AudioPlayerPreExec(void)
{
  /* Initialize internal audio structure */
  memset(&hAudioPlayer, 0, sizeof(AudioPlayer_ContextTypeDef));
  hAudioPlayer.state  = AUDIOPLAYER_STOPPED;
  hAudioPlayer.volume = AUDIO_DEFAULT_VOLUME;  

  /* Initialize the quad SPI flash interface */
  if (BSP_QSPI_Init() != QSPI_OK)
  {
    Error_Handler();
  }
  
  /* Initialize the playlist */
  if (PlaylistInit() != 0)
  {
    Error_Handler();
  }
  
  if(DemoStarted !=  RESET)
  {  
    hAudioPlayer.AudioSource = AudioSourceSelect();
  }
  else
  {
    hAudioPlayer.AudioSource = AUDIO_SOURCE_NONE;
  }
  
  if(BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE, 
                        hAudioPlayer.volume, 
                        hAudioPlayer.WavHeader[hAudioPlayer.AudioSource].SampleRate) != AUDIO_OK)
  {
    Error_Handler();
  }

  /* Configure DMA circular mode and channel number */
  if (hAudioPlayer.WavHeader[hAudioPlayer.AudioSource].NbrChannels == 1)
  {
    BSP_AUDIO_OUT_ChangeAudioConfig(BSP_AUDIO_OUT_CIRCULARMODE | BSP_AUDIO_OUT_MONOMODE);
  }
  else
  {
    BSP_AUDIO_OUT_ChangeAudioConfig(BSP_AUDIO_OUT_CIRCULARMODE | BSP_AUDIO_OUT_STEREOMODE);
  }

  /* Set Callback function pointers */
  BSP_AUDIO_OUT_RegisterCallbacks(AudioPlayer_Error_CallBack,
                                  AudioPlayer_HalfTransfer_CallBack,
                                  AudioPlayer_TransferComplete_CallBack);

  /* Switch off the green led */
  BSP_LED_Off(LED_GREEN);
  
  return KMODULE_OK;
}

/**
  * @brief  Execute the audio player application menu
  * @param  None.
  * @note   run and display audio player Menu.  
  * @retval None.
  */
static KMODULE_RETURN AudioPlayer_Exec(void)
{
  kMenu_Execute(AudioPlayerMenu);
  return KMODULE_OK;
}

/**
  * @brief  Uninitialize AudioPlayer application 
  * @param  None.  
  * @retval None.
  */
KMODULE_RETURN AudioPlayerPostExec(void)
{
  if (BSP_AUDIO_OUT_DeInit() != AUDIO_OK)
  {
    Error_Handler();
  }

  /* De-initialize the quad SPI flash interface */
  if (BSP_QSPI_DeInit() != QSPI_OK)
  {
    Error_Handler();
  }

  /* Switch off the green led */
  BSP_LED_Off(LED_GREEN);
  
  return KMODULE_OK;
}

/**
  * @brief  Run the audio player application 
  * @param  None.
  * @note   None.  
  * @retval None.
  */
void AudioPlayer_Run(void)
{
  uint32_t volume;
  JOYState_TypeDef JOYState = JOY_NONE;
  
  if (hAudioPlayer.AudioSource == AUDIO_SOURCE_NONE)
  {
    BSP_LCD_GLASS_ScrollSentence((uint8_t*)"      NO AUDIO DATA FOUND IN BOTH FLASH AND QSPI FLASH MEMORIES", 1, SCROLL_SPEED_HIGH);
  }
  else
  {
    /* Initialize audio player */
    if (AudioPlayer_Init() != AUDIOPLAYER_ERROR_NONE)
    {
      Error_Handler();
    }
    else
    {
      /* Start audio player */
      if (AudioPlayer_Start(hAudioPlayer.WavHeader[hAudioPlayer.AudioSource].SampleRate) != AUDIOPLAYER_ERROR_NONE)
      {
        Error_Handler();
      }
    
      /* Audio player event loop */
      do 
      {
        JOYState = kMenu_GetEvent(osWaitForever);
        switch(JOYState)
        {
        /* Pause/Resume handling */
        case JOY_SEL:
          if (hAudioPlayer.state == AUDIOPLAYER_STARTED)
          {
            if (AudioPlayer_Pause() != AUDIOPLAYER_ERROR_NONE)
            {
              Error_Handler();
            }
          }
          else if (hAudioPlayer.state == AUDIOPLAYER_PAUSED)
          {
            if (AudioPlayer_Resume() != AUDIOPLAYER_ERROR_NONE)
            {
              Error_Handler();
            }         
          }
          break;
        
        /* Vol + handling */
        case JOY_UP:
          volume = AudioPlayer_GetVolume();
          if (volume < AUDIO_VOLUME_MAX)
          {
            volume++;
            if (AudioPlayer_SetVolume(volume) != AUDIOPLAYER_ERROR_NONE)
            {
              Error_Handler();
            }
          }
          break;
        
        /* Vol - handling */
        case JOY_DOWN:
          volume = AudioPlayer_GetVolume();
          if (volume > AUDIO_VOLUME_MIN)
          {
            volume--;
            if (AudioPlayer_SetVolume(volume) != AUDIOPLAYER_ERROR_NONE)
            {
              Error_Handler();
            }      
          }
          break;
        
        default:
          break;
        }
      } while(JOYState != JOY_LEFT);
    
      /* Stop audio player before close application */
      if (AudioPlayer_Stop() != AUDIOPLAYER_ERROR_NONE)
      {
        Error_Handler();
      }
    
