dpalchak/estoppel/third_party/st/stm32l4_sdk/v1.12.0/Projects/32L476GDISCOVERY/Demonstrations/Modules/audioplayer/audioplayer.c
      /* De-initialize audio player */
      if (AudioPlayer_DeInit() != AUDIOPLAYER_ERROR_NONE)
      {
        Error_Handler();
      }
    }
  }
}

/**
  * @brief  Initializes audio
  * @param  None.
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_Init(void)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;
  
  /* Create audio player Queue */
  osMessageQDef(AUDIO_Queue, 1, uint16_t);
  AudioEvent = osMessageCreate (osMessageQ(AUDIO_Queue), NULL);
  if(AudioEvent == NULL)
  {
    status = AUDIOPLAYER_ERROR_OS;
  }
  else
  {
    /* Create audio player task */
    osThreadDef(osAudioPlayer_Thread, AudioPlayer_Thread, osPriorityHigh, 0, 4 * configMINIMAL_STACK_SIZE);
    AudioThreadId = osThreadCreate (osThread(osAudioPlayer_Thread), NULL);
    if(AudioThreadId == NULL)
    {
      status = AUDIOPLAYER_ERROR_OS;
    }
  }
  return status;
}

/**
  * @brief  Audio player DeInit
  * @param  None.
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_DeInit(void)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;

  vQueueDelete(AudioEvent);
  if(osThreadTerminate(AudioThreadId) != osOK)
  {
    status = AUDIOPLAYER_ERROR_OS;
  }
  return status;
}

/**
  * @brief  Play audio stream
  * @param  frequency: Audio frequency used to play the audio stream.
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_Start(uint32_t frequency)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;
  uint32_t numOfReadBytes;
  
  /* Initialize audio descriptor */
  if (hAudioPlayer.AudioSource == AUDIO_SOURCE_FLASH)
  {
    hAudioPlayer.start = AUDIO_FILE_ADDRESS + WAV_HEADER_SIZE;
    hAudioPlayer.end   = hAudioPlayer.start + hAudioPlayer.WavHeader[AUDIO_SOURCE_FLASH].SubChunk2Size;
    hAudioPlayer.read  = hAudioPlayer.start;
  }
  else
  {
    hAudioPlayer.start = WAV_HEADER_SIZE;
    hAudioPlayer.end   = hAudioPlayer.WavHeader[AUDIO_SOURCE_QSPI].SubChunk2Size;
    hAudioPlayer.read  = hAudioPlayer.start;
  }
  
  /* Fill whole buffer @ first time */
  if (ReadAudio(hAudioPlayer.buffer, 
                AUDIO_BUFFER_SIZE, 
                &numOfReadBytes) == 0)
  { 
    if(numOfReadBytes != 0)
    {
      if (BSP_AUDIO_OUT_SetFrequency(frequency) != AUDIO_OK)
      {
        status = AUDIOPLAYER_ERROR_HW;
      }
      else
      {            
        if(osThreadResume(AudioThreadId) != osOK)
        {
          status = AUDIOPLAYER_ERROR_OS;
        }
        else
        {
          if(BSP_AUDIO_OUT_Play(hAudioPlayer.buffer, AUDIO_BUFFER_SIZE/2) != AUDIO_OK)
          {
            status = AUDIOPLAYER_ERROR_HW;
          }
          else
          {
            hAudioPlayer.state = AUDIOPLAYER_STARTED;
            BSP_LCD_GLASS_Clear(); 
            BSP_LCD_GLASS_DisplayString((uint8_t*)"PLAY");
            /* Switch off green led */
            BSP_LED_Off(LED_GREEN);
          }
        }
      }
    }
    else
    {
      status = AUDIOPLAYER_ERROR_MEM;
    }
  }
  else
  {
    status = AUDIOPLAYER_ERROR_MEM;
  }
  return status;
}

/**
  * @brief  Stop audio stream.
  * @param  None.
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_Stop(void)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;

  if(osThreadSuspend(AudioThreadId) != osOK)
  {
    status = AUDIOPLAYER_ERROR_OS;
  }
  else
  {
    hAudioPlayer.state = AUDIOPLAYER_STOPPED;
    if(BSP_AUDIO_OUT_Stop(CODEC_PDWN_HW) != AUDIO_OK)
    {
      status = AUDIOPLAYER_ERROR_HW;
    }
    else
    {
      hAudioPlayer.state = AUDIOPLAYER_STOPPED;
      /* Switch off green led */
      BSP_LED_Off(LED_GREEN);
    }
  }
  return status;
}

/**
  * @brief  Pause Audio stream
  * @param  None.
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_Pause(void)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;
  
  if(osThreadSuspend(AudioThreadId) != osOK)
  {
    status = AUDIOPLAYER_ERROR_OS;
  }
  else
  {
    if(BSP_AUDIO_OUT_Pause() != AUDIO_OK)
    {
      status = AUDIOPLAYER_ERROR_HW;
    }
    else
    {
      hAudioPlayer.state = AUDIOPLAYER_PAUSED;
      BSP_LCD_GLASS_Clear();
      BSP_LCD_GLASS_DisplayString((uint8_t*)"PAUSED");
      
      /* Switch on the green led */
      BSP_LED_On(LED_GREEN);
    }
  }
  return status;
}


/**
  * @brief  Resume Audio stream
  * @param  None.
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_Resume(void)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;
  
  if(osThreadResume(AudioThreadId) != osOK)
  {
    status = AUDIOPLAYER_ERROR_OS;
  }
  else
  {
    if(BSP_AUDIO_OUT_Resume() != AUDIO_OK)
    {
      status = AUDIOPLAYER_ERROR_HW;
    }
    else
    {
      hAudioPlayer.state = AUDIOPLAYER_STARTED;
      BSP_LCD_GLASS_Clear(); 
      BSP_LCD_GLASS_DisplayString((uint8_t*)"PLAY");
    }
  }
  return status;
}

/**
  * @brief  Get audio volume
  * @param  None.
  * @retval Audio volume.
  */
uint32_t  AudioPlayer_GetVolume(void)
{
  return hAudioPlayer.volume;
}

/**
  * @brief  Set audio volume
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for 
  *         Mute and 100 for Max volume level).
  * @retval Audio state.
  */
AudioPlayer_ErrorTypeDef  AudioPlayer_SetVolume(uint32_t volume)
{
  AudioPlayer_ErrorTypeDef status = AUDIOPLAYER_ERROR_NONE;
  char VolumeString[8];
  
  if(BSP_AUDIO_OUT_SetVolume(volume) == AUDIO_OK)
  {
    hAudioPlayer.volume = volume;
    sprintf(VolumeString, "VOL%lu", hAudioPlayer.volume);
    BSP_LCD_GLASS_Clear();
    BSP_LCD_GLASS_DisplayString((uint8_t*)VolumeString);
  }
  else
  {
    status = AUDIOPLAYER_ERROR_HW;
  }
  return status;
}

/**
  * @brief  Manages the DMA Transfer complete interrupt.
  * @param  None
  * @retval None
  */
static void AudioPlayer_TransferComplete_CallBack(void)
{
  if(hAudioPlayer.state == AUDIOPLAYER_STARTED)
  {
    if(osMessagePut(AudioEvent, PLAYER_BUFFER_OFFSET_FULL, 0) != osOK)
    {
      Error_Handler();
    }
  }
}

/**
  * @brief  Manages the DMA Half Transfer complete interrupt.
  * @param  None
  * @retval None
  */
static void AudioPlayer_HalfTransfer_CallBack(void)
{ 
  if(hAudioPlayer.state == AUDIOPLAYER_STARTED)
  {
    if(osMessagePut(AudioEvent, PLAYER_BUFFER_OFFSET_HALF, 0) != osOK)
    {
      Error_Handler();
    }
  }
}

/**
  * @brief  Manages the DMA FIFO error interrupt.
  * @param  None
  * @retval None
  */
static void AudioPlayer_Error_CallBack(void)
{
  hAudioPlayer.state = AUDIOPLAYER_ERROR;
}

/**
  * @brief  Initializes the playlist
  * @param  None
  * @retval 0: playlist initialized, 1: playlist initialization failed
  */
static uint8_t PlaylistInit(void)
{
  uint8_t status = 0;
  
  /* Retrieve WAV header from Flash memory */
  if(memcpy(&hAudioPlayer.WavHeader[AUDIO_SOURCE_FLASH],
            (void*)AUDIO_FILE_ADDRESS,
            WAV_HEADER_SIZE) == NULL)
  {
    status = 1;
  }
  else
  {
    if(IsValidWAVHeader(&hAudioPlayer.WavHeader[AUDIO_SOURCE_FLASH]))
    {
      hAudioPlayer.NbAudioSources++;
    }
    
