dpalchak/estoppel/third_party/st/stm32l4_sdk/v1.12.0/Projects/32L476GDISCOVERY/Demonstrations/Modules/audioplayer/audioplayer.c
    /* Retreive WAV header from quad SPI flash */
    if(BSP_QSPI_Read((uint8_t*)&hAudioPlayer.WavHeader[AUDIO_SOURCE_QSPI],
                     0,
                     WAV_HEADER_SIZE) != QSPI_OK)
    {
      status = 1;
    }
    else
    {
      if(IsValidWAVHeader(&hAudioPlayer.WavHeader[AUDIO_SOURCE_QSPI]))
      {
        hAudioPlayer.NbAudioSources++;
      }
    }
  }
  return status;
}

/**
  * @brief  Selects the audio source (FLASH v.s. QSPI)
  * @param  None
  * @retval Selected audio source (AUDIO_SOURCE_FLASH or AUDIO_SOURCE_QSPI)
  */
static AudioSource_TypeDef AudioSourceSelect(void)
{
  AudioSource_TypeDef audio_source;
  JOYState_TypeDef JOYState = JOY_NONE;
  
  if (hAudioPlayer.NbAudioSources == 1)
  {
    if (IsValidWAVHeader(&hAudioPlayer.WavHeader[AUDIO_SOURCE_FLASH]))
    {
      audio_source = AUDIO_SOURCE_FLASH;
    }
    else
    {
      audio_source = AUDIO_SOURCE_QSPI;
    }
  }
  else if (hAudioPlayer.NbAudioSources == 2)
  {
    audio_source = AUDIO_SOURCE_FLASH;
    BSP_LCD_GLASS_Clear(); 
    BSP_LCD_GLASS_DisplayString((uint8_t*)"FLASH");
    do 
    {
      JOYState = kMenu_GetEvent(osWaitForever);
      switch(JOYState)
      {
      /* Vol + handling */
      case JOY_UP:
      case JOY_DOWN:
        BSP_LCD_GLASS_Clear(); 
        if (audio_source == AUDIO_SOURCE_FLASH)
        {
          audio_source = AUDIO_SOURCE_QSPI;
          BSP_LCD_GLASS_DisplayString((uint8_t*)"QSPI");
        }
        else
        {
          audio_source = AUDIO_SOURCE_FLASH;
          BSP_LCD_GLASS_DisplayString((uint8_t*)"FLASH");
        }
        break;
      /* Exit subchoice list */
      case JOY_LEFT:
        audio_source = AUDIO_SOURCE_NONE;
        break;
      default:
        break;
      }
    } while((JOYState != JOY_RIGHT) && (JOYState != JOY_SEL) && (audio_source != AUDIO_SOURCE_NONE));
  }
  else
  {
    audio_source = AUDIO_SOURCE_NONE; /* init case */
  }
  return audio_source;
}

/**
  * @brief  Audio task
  * @param  argument: pointer that is passed to the thread function as start argument.
  * @retval None
  */
static void AudioPlayer_Thread(void const * argument)
{
  uint32_t numOfReadBytes;
  osEvent event;
  for(;;)
  {
    event = osMessageGet(AudioEvent, 100);
    
    if(event.status == osEventMessage)
    {
      if(hAudioPlayer.state == AUDIOPLAYER_STARTED)
      {
        switch(event.value.v)
        {
        case PLAYER_BUFFER_OFFSET_HALF:
          if (ReadAudio(&hAudioPlayer.buffer[0],
                        AUDIO_BUFFER_SIZE/2,
                        &numOfReadBytes) == 0)
          {
            if (numOfReadBytes != AUDIO_BUFFER_SIZE/2)
            {
              hAudioPlayer.state = AUDIOPLAYER_EOF;
            }
          }
          else
          {
            hAudioPlayer.state = AUDIOPLAYER_ERROR;
          }
          break;
          
        case PLAYER_BUFFER_OFFSET_FULL:
          if (ReadAudio(&hAudioPlayer.buffer[AUDIO_BUFFER_SIZE/4],
                        AUDIO_BUFFER_SIZE/2,
                        &numOfReadBytes) == 0)
          {
            if (numOfReadBytes != AUDIO_BUFFER_SIZE/2)
            {
              hAudioPlayer.state = AUDIOPLAYER_EOF;
            }
            
            /* Toggle the green led */
            BSP_LED_Toggle(LED_GREEN);
          }
          else
          {
            hAudioPlayer.state = AUDIOPLAYER_ERROR;
          }
          break;
          
        default:
          break;
        }
      }
      if (hAudioPlayer.state == AUDIOPLAYER_EOF)
      {
        /* Stop playback */
        if(BSP_AUDIO_OUT_Stop(CODEC_PDWN_HW) != AUDIO_OK)
        {
          Error_Handler();
        }
        hAudioPlayer.state = AUDIOPLAYER_STOPPED;
        /* Restart playback */
        if(AudioPlayer_Start(hAudioPlayer.WavHeader[hAudioPlayer.AudioSource].SampleRate) != AUDIOPLAYER_ERROR_NONE)
        {
          Error_Handler();
        }        
      }
    }
  }
}

/**
  * @brief  Indicates whether or not the wav header of the audio file is valid
  * @param  WAV_header: WAV header
  * @retval 1 if the wav header is valid, 0 otherwise
  */
static uint8_t IsValidWAVHeader(WAV_HeaderTypeDef* WAV_header)
{
  uint8_t status = 1;

  if (   (strncmp(WAV_header->RIFF, "RIFF", 4) != 0)
      || (strncmp(WAV_header->WAVE, "WAVE", 4) != 0)
      || (WAV_header->AudioFormat != 1))
  {
    status = 0;
  }
  return status;
}

/**
  * @brief  Read a number of audio samples from QSPI flash 
  * @param  buff: Pointer to data buffer
  * @param  btr: Number of bytes to read
  * @param  br: Pointer to number of bytes read
  * @retval 0 if the read operation is successfull, 1 otherwise
  */
static uint8_t ReadAudio(uint16_t* buff, 
                         uint32_t btr, 
                         uint32_t* br)
{
  uint8_t  status = 0;
  uint32_t nb_bytes_to_read = 0;
  
  if (hAudioPlayer.read + btr <= hAudioPlayer.end)
  {
    nb_bytes_to_read = btr;
  }
  else
  {
    nb_bytes_to_read = hAudioPlayer.end - hAudioPlayer.read;
  }
  
  if (hAudioPlayer.AudioSource == AUDIO_SOURCE_FLASH)
  {
    if(memcpy((void*) buff, (void*) hAudioPlayer.read, nb_bytes_to_read) == NULL)
    {
      status = 1;
    }
  }
  else
  {
    if (BSP_QSPI_Read((uint8_t*) buff, hAudioPlayer.read, nb_bytes_to_read) != QSPI_OK)
    {
      status = 1;
    }
  }
  
  hAudioPlayer.read += nb_bytes_to_read;
  *br = nb_bytes_to_read;
  
  return status;
}
/* End of private functions --------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
